Applying locally due to dirty `plan`:

```
% terraform plan -target=aws_route53_record.bsky-verification-txt -out=tfplan
module.production_env.aws_route53_zone.apex: Refreshing state... [id=Z0173878287JIU5M4KB8R]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.bsky-verification-txt will be created
  + resource "aws_route53_record" "bsky-verification-txt" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_atproto.seagl.org"
      + records         = [
          + "did=did:plc:hogmnov6mwgz6mhw2h7763gm",
        ]
      + ttl             = 300
      + type            = "TXT"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as
│ part of an error message.
╵
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 34, in provider "openstack":
│   34: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for neutron-lbaas will be removed on next major release. Octavia will be the only supported method for loadbalancer
│ resources. Users using octavia will have to remove 'use_octavia' option from the provider configuration block. Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 2 more similar warnings elsewhere)
╵

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

% terraform apply tfplan 
aws_route53_record.bsky-verification-txt: Creating...
aws_route53_record.bsky-verification-txt: Still creating... [10s elapsed]
aws_route53_record.bsky-verification-txt: Still creating... [20s elapsed]
aws_route53_record.bsky-verification-txt: Still creating... [30s elapsed]
aws_route53_record.bsky-verification-txt: Still creating... [40s elapsed]
aws_route53_record.bsky-verification-txt: Creation complete after 43s [id=Z0173878287JIU5M4KB8R__atproto.seagl.org_TXT]
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the
│ following command to verify that no other changes are pending:
│     terraform plan
│ 
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically
│ suggests to use it as part of an error message.
╵

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```